FemDesign.Loads.Footfall
footfall_analysis_data

FemDesign.Loads.Footfall.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.Footfall.#ctor(FemDesign.Geometry.Region,System.String,System.String)
Create a Footfall self excitation
region: Contours defining a region to apply footfall analysis on.
identifier:
comment:

FemDesign.Loads.Footfall.#ctor(FemDesign.Geometry.Point3d,System.String,System.String)
Create a Footfall full excitation
position:
identifier:
comment: